#1) Даны два словаря:
# dictionary_1 = {'a': 300, 'b': 400}
# dictionary_2 = {'c': 500, 'd': 600}.
# Объедините их в один при помощи встроенных функций языка Python.
# Результаты выведите на экран.
_dict1 =  {'a': 300, 'b': 400}
_dict2 =  {'c': 500, 'd': 600}

print("До объединения ")
print("Словарь No. 1 содержит : ", _dict1)
print("Словарь No. 2 содержит : ", _dict2)

dict3 = _dict1.copy()

for key, value in _dict2.items():
    dict3[key] = value

print("После объединения двух словарей ")
print(dict3)

#2) Дан словарь с числовыми значениями.
# Необходимо их все перемножить и вывести на экран.
# Результаты выведите на экран.
_dict4 = {}
#3) Создайте словарь, в котором ключами будут числа от 1 до 10,
# а значениями эти же числа, возведенные в куб. Результаты выведите на экран.

#4) Даны два списка одинаковой длины.
# Необходимо создать из них словарь таким образом, чтобы элементы первого списка были ключами,
# а элементы второго — соответственно значениями нашего словаря.
# Результаты выведите на экран.