Python 3.10.5 (tags/v3.10.5:f377153, Jun  6 2022, 16:14:13) [MSC v.1929 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
#1) Дано 2 множества. Проанализировать их и вывести на экран  одного из сообщений в зависимости от ситуации:
#1 – «Объект {X2} является чистым супермножеством» (X2 < X1)
#2 – «Объект {X1} является чистым супермножеством» (X1 < X2)
#3 – «Множества равны» (==)
#4 – «Супермножество не обнаружено» 
#2) Даны два списка чисел, которые могут содержать до 10000 чисел каждый. Выведите все числа, которые входят как в первый, так и во второй список в порядке возрастания. 
#3) Предоставлен список натуральных чисел. Требуется сформировать из них множество. Если какое-либо число повторяется, то преобразовать его в строку по образцу: например, если число 4 повторяется 3 раза, то в множестве будет следующая запись: само число 4, строка «44» (второе повторение, т.е. число дублируется в строке), строка «444» (третье повторение, т.е. строка множится на 3).  Результаты выведите на экран.